api/app/Filters/LogsFilter.php

INSERT INTO `logs` (`ip`, `uri`, `method`, `headers`, `body`, `created_at`) VALUES ('172.18.0.1', 'leads', 'POST', '{\"Content-Type\":{},\"Content-Length\":{},\"Connection\":{},\"Accept-Encoding\":{},\"Host\":{},\"Postman-Token\":{},\"Accept\":{},\"User-Agent\":{},\"Authorization\":{}}', '{\"id\":5,\"first_name\":\"Waldon\",\"last_name\":\"McPeake\",\"email\":\"wmcpeake4@cdc.gov\",\"phone\":\"111-979-1860\",\"birthdate\":\"2002-10-13\"}', '2025-04-12 19:09:55')
---
    public function before(RequestInterface $request, $arguments = null)
    {
        // Log the request
        $requestData = service('request');
        $logsModel = new LogsModel();
        $logData = [
            'ip' => $request->getIPAddress(),
            'uri' => $requestData->getUri()->getRoutePath(),
            'method' => $request->getMethod(),
            'headers' => json_encode($requestData->headers()),
            'body' => json_encode($requestData->getJSON()),
        ];

        try {
            if ($logsModel->insert($logData)) {