api/app/Controllers/Leads.php

    public function index()
    {
        try {
            $leadsModel = new LeadsModel();
            $leads = $leadsModel->findAll();
---
SELECT *
FROM `leads`